app/views/articles/_article.html.haml

SELECT "categories".* FROM "categories" INNER JOIN "article_categories" ON "categories"."id" = "article_categories"."category_id" WHERE "article_categories"."article_id" = $1  [["article_id", 18]]
SELECT 1 AS one FROM "categories" INNER JOIN "article_categories" ON "categories"."id" = "article_categories"."category_id" WHERE "article_categories"."article_id" = $1 LIMIT $2  [["article_id", 18], ["LIMIT", 1]]
---
              by #{link_to article.user.username, user_path(article.user)}
            - if article.categories.any?
              .mt-2= render article.categories
          .card-body