app/views/users/index.html.haml

              = link_to gravatar_for(user, size: 150), user
            %p.card-text= pluralize(user.articles.count, "article")
---
SELECT COUNT(*) FROM "articles" WHERE "articles"."user_id" = $1  [["user_id", 1]]