app/controllers/articles_controller.rb

  def index
    @filterrific = initialize_filterrific(
      Article,
      params[:filterrific],
      select_options: {
        sorted_by: Article.options_for_sorted_by,
        with_category_id: Category.all.map { |c| [c.name, c.id] },
        with_user_id: User.all.map { |u| [u.username, u.id] }

      }
    ) or return
---
SELECT "articles".* FROM "articles"
SELECT "categories".* FROM "categories"
SELECT "users".* FROM "users"

  def create
    @article = Article.new(article_params)
    @article.user = current_user
    if @article.save
---
INSERT INTO "articles" ("title", "description", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "ggggggg"], ["description", "ggggggggggggggggggggg"], ["created_at", "2023-03-16 07:49:47.875494"], ["updated_at", "2023-03-16 07:49:47.875494"], ["user_id", 1]]