app/views/categories/index.html.haml

            %h5.card-title= link_to category.name, category_path(category), class: "text-success"
            %p.card-text= pluralize(category.articles.count, "article")
          .card-footer.text-muted
---
SELECT COUNT(*) FROM "articles" INNER JOIN "article_categories" ON "articles"."id" = "article_categories"."article_id" WHERE "article_categories"."category_id" = $1  [["category_id", 3]]